[
  {
    "original_description": "In the intersection scenario, the ego vehicle maintains a straight trajectory while traversing the intersection under temporary traffic control measures, with the lane designated as a slow-speed zone. The adversarial conditions feature high traffic density (50 vehicles) with two notable adversarial vehicles:  \n1) Adversarial Vehicle [1] positioned to the left of the ego vehicle (lateral distance: 4.44m) executes an unsafe lane change maneuver to the left.  \n2) Adversarial Vehicle [2] ahead of the ego vehicle performs a sudden braking action with a reaction time of 1.68s.  \nThis scenario is reconstructed from the real-world dataset [vehicle_tracks_003_trajectory_set_25.json] of the NGSIM US-101 highway dataset.",
    "file_name": "vehicle_tracks_003_trajectory_set_25.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory while approaching a temporarily closed intersection with normal lane markings. The environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles are present: \n1) A front vehicle (adv1) exhibiting dangerous tailgating behavior with an extremely short following distance of 1.34 meters\n2) Another front vehicle (adv2) performing an unsafe left lane change at a lateral distance of 4.49 meters from the ego vehicle. This scenario is reconstructed from the real-world dataset [vehicle_tracks_001_trajectory_set_34.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_34.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in the fast lane without any temporary control modifications. The simulation introduces high traffic density conditions with approximately 50 vehicles in the vicinity. Two adversarial vehicles are specifically positioned: \n1) Adversary 1 performs dangerous tailgating behavior at an unsafe following distance of 0.56 meters to the ego's right rear\n2) Adversary 2 executes an unsafe left lane change maneuver from the right side at a distance of 4.02 meters. This scenario is reconstructed from the [vehicle_tracks_000_trajectory_set_101.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_000_trajectory_set_101.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection without any temporary maneuver changes, operating under special lane regulations. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles are strategically positioned: \n1) A rear vehicle exhibiting sudden braking behavior with delayed reaction time (2.36s) \n2) A left-side vehicle performing an unsafe rightward lane change at close proximity (1.48m lateral distance). The scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_105.json], specifically capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_002_trajectory_set_105.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle is proceeding straight through the intersection under temporary traffic control measures, with its current lane marked as a special type. The traffic density is medium, with approximately 20 vehicles in the vicinity. Two adversarial vehicles are present: \n1) An aggressive vehicle positioned to the left of the ego vehicle, performing an unsafe right lane change maneuver with a lateral offset of approximately 1.7 meters.\n2) A tailgating vehicle directly in front of the ego vehicle, following dangerously close at a distance of only 0.62 meters. This scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_006_trajectory_set_114.json] dataset.",
    "file_name": "vehicle_tracks_006_trajectory_set_114.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle is proceeding straight through a temporarily closed intersection while adhering to normal lane regulations. The traffic density is medium with approximately 20 vehicles present. Two adversarial vehicles create challenging conditions: \n1) Adversarial Vehicle 1 positioned directly ahead of the ego vehicle exhibits sudden acceleration behavior (speed increase: ~9.18 m/s)\n2) Adversarial Vehicle 2 located to the right of the ego vehicle demonstrates aggressive speeding behavior (speed increase: ~10.90 m/s). \nThis scenario is reconstructed from the [vehicle_tracks_001_trajectory_set_154.json] dataset, capturing realistic intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_154.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules without any temporary lane changes. The vehicle operates in a normal lane type under high traffic density conditions (50 vehicles in proximity). Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversary 1 positioned directly behind the ego vehicle exhibits sudden braking behavior with a delayed reaction time of 1.94 seconds\n2) Adversary 2 approaches dangerously close from the right side with aggressive tailgating behavior, maintaining an unsafe following distance of just 1.34 meters. This scenario is reconstructed from the [vehicle_tracks_011_trajectory_set_80.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_011_trajectory_set_80.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road segment is marked as a special lane type due to ongoing traffic control measures. Traffic density remains low with only 5 vehicles present in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) Vehicle 1 positions itself on the right side of the ego vehicle and executes a sudden braking maneuver with a reaction time of 1.31 seconds\n2) Vehicle 2 follows dangerously close behind the ego vehicle at a distance of merely 1.12 meters, exhibiting aggressive tailgating behavior.\n\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_002_trajectory_set_148.json].",
    "file_name": "vehicle_tracks_002_trajectory_set_148.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in a slow lane without any temporary control modifications. The scene features high traffic density with approximately 50 vehicles present. \n\nTwo primary adversarial vehicles create challenging conditions:\n1) Adversary 1 positions itself dangerously close behind the ego vehicle (1.07m rear gap) exhibiting aggressive tailgating behavior\n2) Adversary 2 maintains an unsafe following distance (0.96m) while occupying the right adjacent lane, creating a dual-threat tailgating situation\n\nThis scenario is reconstructed from the [vehicle_tracks_012_trajectory_set_54.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_012_trajectory_set_54.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles are strategically positioned to test the ego vehicle's response: \n1) A front vehicle executing an unsafe right lane change at 4.7 meters ahead\n2) A right-side vehicle preparing for sudden braking with 2.8 seconds reaction time. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_90.json] capturing typical urban intersection challenges.",
    "file_name": "vehicle_tracks_002_trajectory_set_90.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features low traffic density with only 5 vehicles present. Two adversarial vehicles exhibit dangerous behaviors: \n1) Vehicle [1] positioned at the rear initiates an unsafe right lane change with 1.31m lateral displacement\n2) Vehicle [2] on the right side performs an aggressive left lane change with 1.19m lateral shift. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_003_trajectory_set_24.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_003_trajectory_set_24.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules with no temporary lane changes. The road condition is normal with low traffic density (5 vehicles in vicinity). Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversary 1 positioned directly ahead of the ego vehicle will execute a sudden braking maneuver with 2.17s reaction time\n2) Adversary 2 located behind the ego vehicle will perform sudden braking with 2.73s reaction time. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_003_trajectory_set_28.json] in the 'go_straight' dataset.",
    "file_name": "vehicle_tracks_003_trajectory_set_28.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to normal lane discipline without any temporary traffic control modifications. The traffic density is low with approximately 5 vehicles in the vicinity. Two adversarial vehicles are positioned ahead of the ego vehicle: \n1) An aggressive vehicle performing an unsafe left lane change at 1.53 meters lateral offset\n2) A tailgating vehicle following dangerously close at 1.34 meters longitudinal distance. \nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_003_trajectory_set_48.json].",
    "file_name": "vehicle_tracks_003_trajectory_set_48.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection without any temporary lane changes, operating in a special lane type under low traffic density conditions (5 vehicles total). Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 positions itself at the right-rear of the ego vehicle with an unsafe following distance of 0.96 meters\n2) Adversary 2 approaches from the front with an extremely close distance of 0.81 meters\nThe scenario is reconstructed from real-world driving data recorded in [vehicle_tracks_001_trajectory_set_37.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_37.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with slow-lane speed regulations. The simulation environment features medium traffic density with approximately 20 vehicles. Two primary adversarial vehicles are positioned ahead of the ego vehicle: Vehicle 1 executes an unsafe right lane change with 1.19m lateral offset, while Vehicle 2 exhibits dangerous tailgating behavior with only 1.23m following distance. This scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_9.json] capturing urban intersection dynamics.",
    "file_name": "vehicle_tracks_012_trajectory_set_9.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road configuration consists of normal lane types with medium traffic density (approximately 20 vehicles). Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 positions itself directly in front of the ego vehicle with an unsafe following distance of 1.34 meters\n2) Adversary 2 maintains an even more aggressive left-side tailgating position at merely 0.88 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_93.json], capturing a critical intersection negotiation under constrained conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_93.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in the slow lane. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned on the right side performs aggressive speeding with a 6.05 m/s velocity increase\n2) Adversary 2 approaches from the rear while executing an unsafe left lane change at 3.41m distance. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_010_trajectory_set_27.json] capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_010_trajectory_set_27.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to temporary road closure regulations. The vehicle operates in a fast lane configuration with low traffic density (5 vehicles present). Two adversarial vehicles introduce challenging conditions: \n1) Adversary 1 positions itself at the right-rear of the ego vehicle (0.97m gap) exhibiting aggressive tailgating behavior\n2) Adversary 2 approaches from the left side with sudden braking capability (1.35s reaction time). This scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_178.json], capturing a rule-regulated intersection traversal under special traffic control conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_178.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) An aggressive vehicle positioned directly ahead initiates an unsafe left lane change with a lateral offset of 2.41 meters\n2) A tailgating vehicle maintains dangerously close proximity (1.40 meters) on the right side of the ego vehicle. This scenario is reconstructed from real-world driving data [vehicle_tracks_003_trajectory_set_33.json], capturing complex urban intersection dynamics.",
    "file_name": "vehicle_tracks_003_trajectory_set_33.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road condition is normal with low traffic density (5 vehicles in vicinity). Two adversarial vehicles are positioned behind the ego vehicle: \n1) Adversary 1 exhibits sudden braking behavior with delayed reaction time (2.06s) \n2) Adversary 2 initiates an unsafe right lane change at close proximity (2.86m lateral distance). This scenario is reconstructed from real-world driving data [vehicle_tracks_008_trajectory_set_123.json] representing typical urban intersection conflicts.",
    "file_name": "vehicle_tracks_008_trajectory_set_123.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle is proceeding straight through the intersection in the fast lane with low traffic density (5 vehicles present). Two adversarial vehicles create challenging conditions: \n1) ADV1 positioned at the right-side with unsafe leftward lane change behavior at 3.91m distance\n2) ADV2 approaching from the rear with another unsafe leftward lane change maneuver at 4.31m distance. \nThe scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_32.json] with preserved spatial relationships and conflict patterns.",
    "file_name": "vehicle_tracks_002_trajectory_set_32.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with standard traffic rules. The road conditions show medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned on the left initiates an unsafe lane change maneuver towards the right with an initial lateral offset of 2.05 meters\n2) Adversary 2 located on the right simultaneously performs another unsafe right lane change from 2.95 meters lateral distance. \nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_001_trajectory_set_99.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_99.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road segment is designated as a fast lane with medium traffic density (approximately 20 vehicles). Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversary 1 positioned directly ahead of the ego vehicle will execute a sudden braking maneuver with a reaction time of 1.57 seconds\n2) Adversary 2 located on the right side will perform a sudden brake with a slightly delayed reaction time of 2.27 seconds. This scenario is reconstructed from the real-world dataset [vehicle_tracks_001_trajectory_set_30.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_30.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in a slow lane configuration without any temporary traffic control modifications. The traffic density is low with only 5 vehicles present. Two adversarial vehicles introduce challenging conditions: \n1) Adversary 1 positioned to the left performs a sudden braking maneuver with a reaction time of 1.04 seconds\n2) Adversary 2 ahead executes an unsafe right lane change with a lateral offset of 1.6 meters. This scenario is reconstructed from the real-world dataset [vehicle_tracks_005_trajectory_set_103.json] capturing typical urban intersection behaviors.",
    "file_name": "vehicle_tracks_005_trajectory_set_103.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road configuration designates the current lane as a fast lane with low traffic density (approximately 5 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned on the right performs a sudden braking maneuver with a reaction time of 1.35 seconds\n2) Adversary 2 on the left engages in dangerous tailgating behavior, maintaining an unsafe following distance of 0.75 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_003_trajectory_set_95.json].",
    "file_name": "vehicle_tracks_003_trajectory_set_95.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary traffic control measures, operating in a specially designated lane. The traffic density is low with only 5 vehicles present. Two adversarial vehicles create challenging conditions: \n1) An adversarial vehicle positioned to the right initiates an unsafe left lane change maneuver at a distance of 4.46 meters from the ego vehicle\n2) A rear-positioned adversarial vehicle executes sudden braking with a reaction time of 1.26 seconds. This scenario is reconstructed from the [vehicle_tracks_011_trajectory_set_32.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_011_trajectory_set_32.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles are positioned to the right of the ego vehicle: Vehicle 1 exhibits aggressive speeding behavior with significant velocity increase, while Vehicle 2 performs sudden braking with delayed reaction time. This scenario is reconstructed from the real-world dataset [vehicle_tracks_011_trajectory_set_70.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_011_trajectory_set_70.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The vehicle operates under special lane conditions without any temporary traffic control modifications. The environment features high traffic density with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions:\n1) Adversary 1 positioned directly behind the ego vehicle initiates an unsafe right lane change maneuver at a distance of 2.55 meters\n2) Adversary 2 approaches from the right side with significant speed acceleration (12.96 m/s increase)\n\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_000_trajectory_set_106.json].",
    "file_name": "vehicle_tracks_000_trajectory_set_106.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in the slow lane. The simulation environment features low traffic density with only 5 vehicles present. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) Adversarial Vehicle 1 is located on the right side of the ego vehicle, exhibiting aggressive speeding behavior with a significant velocity increase.\n2) Adversarial Vehicle 2 is also positioned on the right, executing an unsafe leftward lane change maneuver at close proximity. This scenario is reconstructed from real-world driving data [vehicle_tracks_000_trajectory_set_82.json], specifically capturing \"go_straight\" intersection behaviors under constrained road conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_82.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary road closure conditions, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The scene features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are positioned behind the ego vehicle, both exhibiting unsafe lane change behaviors: \n- Adversary 1 initiates a left lane change at 2.74 meters rear offset\n- Adversary 2 performs a right lane change at 1.22 meters rear offset\nThe scenario is reconstructed from real-world trajectory data [vehicle_tracks_001_trajectory_set_110.json], capturing authentic urban intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_110.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in the fast lane. The simulation environment features medium traffic density with approximately 20 vehicles. Two primary adversarial vehicles are introduced: \n1) A rear vehicle performing sudden braking with delayed reaction time (2.01s) \n2) A leading vehicle executing abrupt braking with faster reaction (1.39s). \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_003_trajectory_set_17.json], specifically capturing \"go_straight\" intersection maneuvers under constrained conditions.",
    "file_name": "vehicle_tracks_003_trajectory_set_17.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles present. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned at the rear initiates an unsafe right lane change at a distance of 3.66 meters \n2) Adversary 2 on the left side performs another unsafe right lane change at 3.16 meters distance. The scenario is reconstructed from real-world driving data [vehicle_tracks_005_trajectory_set_96.json] capturing typical intersection conflicts.",
    "file_name": "vehicle_tracks_005_trajectory_set_96.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles present. Two adversarial vehicles exhibit dangerous speeding behaviors: \n1) Vehicle [1] positioned directly ahead of the ego vehicle demonstrates sudden acceleration with a speed increase of 12.46 m/s\n2) Vehicle [2] located on the right side accelerates aggressively with a 9.95 m/s speed boost\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_004_trajectory_set_18.json], specifically capturing \"go_straight\" intersection maneuvers under controlled conditions.",
    "file_name": "vehicle_tracks_004_trajectory_set_18.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to traffic rules with no temporary lane changes permitted. The vehicle operates in a slow lane configuration with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned at the rear initiates an unsafe left lane change maneuver with a lateral displacement of 3.3 meters\n2) Adversary 2 in front exhibits dangerous tailgating behavior with an unsafe following distance of 1.19 meters. This scenario is reconstructed from the [vehicle_tracks_005_trajectory_set_88.json] dataset in the 'go_straight' collection.",
    "file_name": "vehicle_tracks_005_trajectory_set_88.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The ego is positioned in a fast lane with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles are introduced to create challenging conditions: \n1) A rear vehicle performing sudden braking with delayed reaction time (2.23s) \n2) A right-side vehicle exhibiting aggressive speeding behavior (5.76 m/s speed increase). This scenario is reconstructed from real-world driving data [vehicle_tracks_005_trajectory_set_69.json] capturing intersection traversal patterns.",
    "file_name": "vehicle_tracks_005_trajectory_set_69.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in a slow lane configuration without any temporary traffic control modifications. The simulation environment features high traffic density with approximately 50 vehicles present. Two primary adversarial vehicles are positioned ahead of the ego vehicle: \n- Adversarial Vehicle 1 exhibits aggressive speeding behavior with a significant velocity increase\n- Adversarial Vehicle 2 similarly demonstrates dangerous acceleration patterns\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_75.json], capturing authentic intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_75.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while approaching a temporarily closed intersection with fast-lane specifications. The simulation environment features high traffic density with approximately 50 vehicles in the vicinity. Two primary adversarial vehicles are positioned to the right of the ego vehicle, both exhibiting dangerous speeding behaviors: \n- Adversary 1 demonstrates aggressive acceleration with a speed increase of 14.94 m/s\n- Adversary 2 shows similar speeding behavior with a 13.76 m/s velocity boost\nThe scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_008_trajectory_set_89.json] dataset, capturing a challenging urban intersection scenario with rule violations.",
    "file_name": "vehicle_tracks_008_trajectory_set_89.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection without any temporary route modifications. The vehicle adheres to standard traffic rules while navigating through normal lane conditions. The environment features high traffic density with approximately 50 vehicles present. \n\nTwo adversarial vehicles create challenging conditions: \n1) A front-positioned vehicle (relative to ego) executing an unsafe right lane change maneuver with 2.99m lateral displacement\n2) A right-side vehicle exhibiting aggressive speeding behavior with an 11.49 m/s velocity increase\n\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_003_trajectory_set_110.json], specifically capturing intersection traversal behaviors.",
    "file_name": "vehicle_tracks_003_trajectory_set_110.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules in the fast lane. The scene features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles create challenging conditions: \n1) A tailgating vehicle positioned dangerously close (1.15m) to the ego's right rear, and \n2) A speeding vehicle ahead of the ego with a significant speed increase of 9.87 m/s. \nThe scenario is reconstructed from real-world driving data [vehicle_tracks_011_trajectory_set_43.json] representing typical urban intersection behaviors.",
    "file_name": "vehicle_tracks_011_trajectory_set_43.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules in the fast lane. The simulation environment features low traffic density with only 5 vehicles present. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned at the rear (3.57m behind ego) initiates an unsafe right lane change maneuver\n2) Adversary 2 located ahead (2.58m in front of ego) simultaneously performs another unsafe right lane change. \nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_005_trajectory_set_27.json], preserving the original spatial relationships and conflict patterns.",
    "file_name": "vehicle_tracks_005_trajectory_set_27.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules without any temporary lane changes. The vehicle operates in a normal lane type under medium traffic density conditions (approximately 20 vehicles in the vicinity). Two adversarial vehicles are positioned behind the ego vehicle with dangerously close following distances: \n- Adversary 1 tailgates at 1.34 meters \n- Adversary 2 follows aggressively at just 0.55 meters \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_011_trajectory_set_26.json] representing a typical urban intersection crossing situation.",
    "file_name": "vehicle_tracks_011_trajectory_set_26.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary traffic control measures in the fast lane. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles are introduced to create challenging conditions: \n1) A rear vehicle performing sudden braking with a reaction time of 1.83 seconds\n2) A front vehicle engaging in aggressive tailgating behavior with an unsafe following distance of 0.8 meters. \nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_005_trajectory_set_76.json] dataset.",
    "file_name": "vehicle_tracks_005_trajectory_set_76.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory under normal traffic conditions with no temporary road changes. The vehicle operates in a special lane type configuration. The traffic density is low with only 5 vehicles present in the vicinity. \n\nTwo adversarial vehicles create challenging conditions:\n1) Adversary 1 positions itself on the left side of the ego vehicle with an unsafe tailgating distance of approximately 1.12 meters\n2) Adversary 2 follows dangerously close on the right side with only 0.81 meters clearance\n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_011_trajectory_set_73.json] dataset, capturing a typical urban intersection situation with multiple traffic participants exhibiting aggressive following behaviors.",
    "file_name": "vehicle_tracks_011_trajectory_set_73.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to temporary road closure regulations. The ego vehicle is positioned in the fast lane with high traffic density (approximately 50 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) A rear vehicle performing an unsafe left lane change with 1.55m lateral offset\n2) A leading vehicle that will execute sudden braking after a 2.18s reaction time. This scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_22.json], specifically capturing \"go_straight\" intersection behaviors under constrained road conditions.",
    "file_name": "vehicle_tracks_012_trajectory_set_22.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features low traffic density with only 5 vehicles present. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positions itself at the right-rear of the ego vehicle (1.11m gap) exhibiting dangerous tailgating behavior\n2) Adversary 2 approaches from the front-left (4.40m ahead) preparing for an unsafe lane change maneuver. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_12.json] capturing a \"go_straight\" intersection negotiation.",
    "file_name": "vehicle_tracks_012_trajectory_set_12.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic rules. The road environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positions itself at the right-rear of the ego vehicle (0.83m gap) exhibiting dangerous tailgating behavior\n2) Adversary 2 approaches from the front with significant speed increase (+5.6m/s), creating a potential head-on conflict situation. The scenario is reconstructed from real-world dataset [vehicle_tracks_009_trajectory_set_137.json].",
    "file_name": "vehicle_tracks_009_trajectory_set_137.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road condition is classified as normal lane type with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) An aggressive vehicle positioned to the left executes sudden braking with a delayed reaction time of 2.44 seconds\n2) A tailgating vehicle maintains dangerously close proximity (1.37m following distance) directly ahead of the ego vehicle. This scenario is reconstructed from real-world driving data [vehicle_tracks_009_trajectory_set_98.json] capturing typical urban intersection conflicts.",
    "file_name": "vehicle_tracks_009_trajectory_set_98.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory while navigating through a temporarily closed intersection with special lane markings. The simulation environment features low traffic density with 5 surrounding vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned on the right side initiates an unsafe right lane change at 3.34 meters lateral distance\n2) Adversary 2 approaching from the rear attempts another unsafe right lane change at 3.65 meters following distance. The scenario is reconstructed from real-world driving data [vehicle_tracks_000_trajectory_set_25.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_000_trajectory_set_25.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with traffic rules under special lane conditions. The simulation environment features low traffic density with only 5 vehicles present. Two adversarial vehicles exhibit dangerous speeding behaviors: \n1) Vehicle [1] positioned directly ahead of the ego vehicle suddenly accelerates with a speed increase of 7.33 m/s\n2) Vehicle [2] located on the right side performs aggressive speeding with an 8.99 m/s velocity boost. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_120.json] in the 'go_straight' dataset.",
    "file_name": "vehicle_tracks_002_trajectory_set_120.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) Adversary 1 performs a sudden braking maneuver from the left side with a reaction time of 1.3 seconds\n2) Adversary 2 exhibits tailgating behavior from the left with an unsafe following distance of 1.15 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_004_trajectory_set_68.json] capturing typical urban intersection interactions.",
    "file_name": "vehicle_tracks_004_trajectory_set_68.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles are positioned ahead of the ego vehicle: \n1) Adversary 1 exhibits dangerous speeding behavior with a significant velocity increase of 8.58 m/s\n2) Adversary 2 performs an unsafe left lane change at a close proximity of 1.14 meters lateral distance. This scenario is reconstructed from the [vehicle_tracks_001_trajectory_set_11.json] dataset, capturing realistic intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_11.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with slow-lane speed restrictions. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles are positioned behind the ego vehicle: \n1) Adversary Vehicle 1 exhibits aggressive speeding behavior with a significant velocity increase\n2) Adversary Vehicle 2 performs sudden braking with delayed reaction time. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_125.json] capturing a \"go_straight\" intersection maneuver.",
    "file_name": "vehicle_tracks_002_trajectory_set_125.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in a slow lane configuration without any temporary traffic control modifications. The traffic density is low with only 5 vehicles present in the vicinity. Two adversarial vehicles are positioned behind the ego vehicle, both exhibiting dangerous speeding behaviors: \n- Adversary 1 is executing a moderate speed increase (5.53 m/s acceleration)\n- Adversary 2 demonstrates more aggressive speeding (9.79 m/s acceleration)\nThis scenario is reconstructed from the real-world dataset [vehicle_tracks_012_trajectory_set_32.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_012_trajectory_set_32.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations (marked as special lane type). The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 performs an unsafe left lane change from a distance of 4.75 meters on the left side\n2) Adversary 2 initiates another unsafe left lane change at a closer distance of 1.55 meters, also from the left side. This scenario is reconstructed from real-world driving data [vehicle_tracks_004_trajectory_set_98.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_004_trajectory_set_98.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road segment is designated as a fast lane with medium traffic density (approximately 20 vehicles). Two adversarial vehicles are present: \n1) Adversary 1 positioned on the left side with an unsafe right lane change maneuver (lateral offset: 1.42m)\n2) Adversary 2 located ahead with an unsafe left lane change behavior (longitudinal distance: 4.38m). \nThe scenario is reconstructed from real-world driving data [vehicle_tracks_008_trajectory_set_87.json].",
    "file_name": "vehicle_tracks_008_trajectory_set_87.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The ego vehicle is positioned in the fast lane with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 maintains an unsafe following distance of 0.96 meters on the right side\n2) Adversary 2 follows even closer at 0.80 meters on the left side\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_005_trajectory_set_99.json] capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_005_trajectory_set_99.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to traffic rules without any temporary control modifications. The vehicle operates in a slow lane configuration within a low traffic density environment (5 vehicles total). Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversary 1 positioned directly ahead of the ego vehicle will execute a sudden braking maneuver with a reaction time of 1.84 seconds\n2) Adversary 2 located to the left of the ego vehicle will perform a similar sudden brake action but with a delayed reaction time of 2.44 seconds. This scenario is reconstructed from the [vehicle_tracks_015_trajectory_set_63.json] dataset in the 'go_straight' collection.",
    "file_name": "vehicle_tracks_015_trajectory_set_63.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The vehicle operates in a slow lane configuration without any temporary traffic control modifications. The simulation environment features high traffic density with approximately 50 vehicles. \n\nTwo adversarial vehicles create challenging conditions:\n1. A leading vehicle (adv1) positioned directly ahead of the ego vehicle will execute a sudden braking maneuver with a delayed reaction time of 2.2 seconds\n2. A following vehicle (adv2) located at the rear will perform an unsafe left lane change with a lateral offset of 1.04 meters\n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_011_trajectory_set_103.json] dataset.",
    "file_name": "vehicle_tracks_011_trajectory_set_103.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle is proceeding straight through a temporarily closed intersection while maintaining normal lane discipline. The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are positioned ahead of the ego vehicle: \n1) A tailgating vehicle maintaining an unsafe following distance of 0.65 meters directly in front\n2) A vehicle performing an unsafe left lane change from 4.14 meters ahead. This scenario is reconstructed from the [vehicle_tracks_006_trajectory_set_8.json] dataset, capturing realistic urban intersection dynamics under temporary closure conditions.",
    "file_name": "vehicle_tracks_006_trajectory_set_8.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules with no temporary lane changes permitted. The road condition is classified as normal lane type with low traffic density (5 vehicles in the vicinity). Two adversarial vehicles are positioned ahead of the ego vehicle: \n1) Adversary 1 performs an unsafe left lane change at a distance of 2.2 meters \n2) Adversary 2 executes a sudden braking maneuver with a 2.55-second reaction time. This scenario is reconstructed from the real-world driving dataset [vehicle_tracks_015_trajectory_set_2.json].",
    "file_name": "vehicle_tracks_015_trajectory_set_2.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary traffic control measures in a slow-speed lane. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Vehicle [1] positioned on the right side of the ego vehicle demonstrates aggressive speeding behavior with a significant velocity increase\n2) Vehicle [2] located on the left performs an unsafe lane change maneuver to the right with dangerously close proximity. This scenario is reconstructed from real-world driving data [vehicle_tracks_014_trajectory_set_20.json] capturing typical urban intersection interactions.",
    "file_name": "vehicle_tracks_014_trajectory_set_20.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with normal lane regulations and without any temporary traffic control modifications. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) Adversary 1 initiates an unsafe right lane change maneuver from the rear position (lateral offset: 2.6m)\n2) Adversary 2 executes sudden acceleration from the front position with significant speed increase (13.77 m/s boost). \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_018_trajectory_set_75.json] in the 'go_straight' dataset.",
    "file_name": "vehicle_tracks_018_trajectory_set_75.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road condition is characterized by low traffic density (approximately 5 vehicles in the vicinity). Two adversarial vehicles exhibit hazardous behaviors: \n1) ADV1 positioned on the right side initiates an unsafe lane change maneuver with a lateral offset of 1.89 meters\n2) ADV2 in front maintains dangerously close following distance of 1.07 meters (tailgating behavior). \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_68.json], preserving the original spatial relationships and motion patterns.",
    "file_name": "vehicle_tracks_001_trajectory_set_68.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations (marked as special lane type). The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) Adversary 1 is located to the left of the ego vehicle, programmed to execute sudden braking with a reaction time of 2.29 seconds\n2) Adversary 2 is positioned ahead of the ego vehicle, configured to dangerously accelerate with a speed boost of 11.6 m/s. This scenario is reconstructed from real-world driving data [vehicle_tracks_015_trajectory_set_35.json], specifically capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_015_trajectory_set_35.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road segment is marked as a special lane type due to ongoing construction activities. The traffic density is high with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) A left-side vehicle exhibiting aggressive speeding behavior with significant velocity increase\n2) A right-side vehicle performing unsafe lane changes with improper lateral maneuvers\n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_012_trajectory_set_132.json] dataset, capturing complex urban intersection dynamics under temporary traffic control conditions.",
    "file_name": "vehicle_tracks_012_trajectory_set_132.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The environment features high traffic density with approximately 50 surrounding vehicles. Two adversarial vehicles exhibit hazardous behaviors: \n1) A leading vehicle positioned directly ahead of the ego executes sudden braking with a delayed reaction time of 2.72 seconds\n2) A left-offset vehicle performs an unsafe rightward lane change at a lateral distance of 1.03 meters. \nThe scenario is reconstructed from real-world driving data [vehicle_tracks_004_trajectory_set_72.json] capturing urban intersection dynamics.",
    "file_name": "vehicle_tracks_004_trajectory_set_72.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in the fast lane. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 positions itself aggressively close (0.55m) in front of the ego vehicle\n2) Adversary 2 maintains an unsafe following distance (0.61m) behind the ego vehicle\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_92.json], capturing critical interaction patterns during temporary intersection closures.",
    "file_name": "vehicle_tracks_001_trajectory_set_92.json"
  },
  {
    "original_description": "In this intersection crossing scenario with temporary traffic control measures, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features medium traffic density (approximately 20 vehicles). Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned to the left of the ego vehicle exhibits aggressive speeding behavior with significant velocity increase\n2) Adversary 2 also located on the left performs sudden braking maneuvers with delayed reaction time. This scenario is reconstructed from real-world driving data [vehicle_tracks_010_trajectory_set_75.json] capturing typical intersection interactions.",
    "file_name": "vehicle_tracks_010_trajectory_set_75.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory while navigating through a temporarily closed intersection with slow lane conditions. The traffic density is low with only 5 vehicles present. Two adversarial vehicles are positioned to the left of the ego vehicle, both exhibiting aggressive speeding behavior: \n- Adversarial Vehicle 1 demonstrates a significant speed increase of 13.01 m/s\n- Adversarial Vehicle 2 shows a speed boost of 10.66 m/s\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_005_trajectory_set_21.json] dataset.",
    "file_name": "vehicle_tracks_005_trajectory_set_21.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road segment is temporarily designated as a special lane type with no permitted lane changes. The scenario features high traffic density with approximately 50 vehicles in the vicinity. \n\nTwo primary adversarial vehicles are positioned ahead of the ego vehicle: \n1) Adversary 1 performs an unsafe left lane change at 1.16 meters lateral offset\n2) Adversary 2 initiates another hazardous left lane change at 3.20 meters ahead. \n\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_011_trajectory_set_88.json], capturing a typical urban intersection conflict situation.",
    "file_name": "vehicle_tracks_011_trajectory_set_88.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road condition indicates no temporary traffic control measures are in effect, with the ego vehicle occupying a special lane type. The traffic density is low (5 vehicles in the vicinity). \n\nTwo adversarial vehicles are present:\n1. Adversary 1 is positioned to the right of the ego vehicle, exhibiting aggressive speeding behavior with a significant velocity increase.\n2. Adversary 2 is also located on the right side, executing a sudden braking maneuver with delayed reaction time.\n\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_000_trajectory_set_64.json] in the 'go_straight' dataset, capturing typical intersection interactions.",
    "file_name": "vehicle_tracks_000_trajectory_set_64.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in the fast lane without any temporary movement restrictions. The simulation introduces high traffic density conditions with approximately 50 surrounding vehicles. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned on the right side exhibits aggressive speeding behavior with a significant velocity increase\n2) Adversary 2 also located on the right executes a sudden braking maneuver with delayed reaction time. This scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_172.json] capturing typical urban intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_172.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) ADV1 positioned on the right side performs aggressive speeding with a significant velocity increase (~14.82 m/s)\n2) ADV2 follows dangerously close from behind with an unsafe following distance of ~0.56m (tailgating behavior). \nThe scenario is reconstructed from real-world trajectory data [vehicle_tracks_001_trajectory_set_102.json] capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_001_trajectory_set_102.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road condition features low traffic density with only 5 vehicles present. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned on the right side exhibits aggressive speeding behavior with a significant speed increase\n2) Adversary 2 ahead of the ego vehicle initiates an unsafe left lane change at close proximity. This scenario is reconstructed from the [vehicle_tracks_001_trajectory_set_93.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_93.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in the fast lane without any temporary control constraints. The traffic density is medium with approximately 20 vehicles in the vicinity. Two adversarial vehicles create challenging conditions: \n1) ADV1 positioned on the right side exhibits aggressive speeding behavior with significant velocity increase\n2) ADV2 also on the right maintains dangerously close following distance (tailgating). This scenario is reconstructed from real-world driving data [vehicle_tracks_011_trajectory_set_57.json] representing typical intersection interactions.",
    "file_name": "vehicle_tracks_011_trajectory_set_57.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary road closure conditions, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned on the right side performs aggressive speeding with a significant velocity increase\n2) Adversary 2 approaching from the rear initiates an unsafe right lane change maneuver with improper distance margins. The scenario is reconstructed from real-world driving data [vehicle_tracks_011_trajectory_set_67.json] capturing \"go straight\" intersection behaviors.",
    "file_name": "vehicle_tracks_011_trajectory_set_67.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road segment is marked as a special lane type due to ongoing construction or traffic control measures. The traffic density is moderate with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) An aggressive speeding vehicle approaching from the left side with significant speed increase (10.75 m/s boost)\n2) A dangerously close tailgating vehicle following from behind with only 0.74 meters gap\n\nThe scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_003_trajectory_set_33.json], capturing authentic intersection dynamics under temporary traffic control conditions.",
    "file_name": "vehicle_tracks_003_trajectory_set_33.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles create challenging conditions: \n1) A rear vehicle positioned 1.09 meters behind initiates an unsafe left lane change maneuver\n2) A front vehicle maintains dangerously close following distance of 0.83 meters (tailgating behavior). The scenario is reconstructed from real-world dataset [vehicle_tracks_009_trajectory_set_15.json] capturing straight-through intersection maneuvers.",
    "file_name": "vehicle_tracks_009_trajectory_set_15.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density (50 vehicles) with two primary adversarial vehicles exhibiting dangerous behaviors: \n1) Adversary 1 positioned directly behind the ego vehicle demonstrates aggressive speeding behavior with a significant velocity increase (8.02 m/s)\n2) Adversary 2 located at the rear-right quadrant initiates an unsafe lane change maneuver to the right with a lateral displacement of 2.96 meters. The scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_135.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_135.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features low traffic density with only 5 vehicles present. Two adversarial vehicles are positioned to the left of the ego vehicle, both exhibiting unsafe lane change behaviors. The first adversarial vehicle initiates a left lane change at approximately 4.58 meters ahead, while the second adversarial vehicle performs a more aggressive left lane change maneuver at just 2.32 meters ahead. This scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_013_trajectory_set_55.json] dataset.",
    "file_name": "vehicle_tracks_013_trajectory_set_55.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to traffic rules without any temporary control changes. Operating in a slow lane configuration, the ego vehicle navigates through medium-density traffic with approximately 20 surrounding vehicles. Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 follows closely behind the ego vehicle at a dangerously short distance of 1.14 meters \n2) Adversary 2 maintains aggressive proximity from the left side at 1.48 meters. This scenario is reconstructed from the real-world driving dataset [vehicle_tracks_001_trajectory_set_35.json], capturing authentic intersection interactions.",
    "file_name": "vehicle_tracks_001_trajectory_set_35.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while adhering to traffic rules with no temporary lane changes permitted. The vehicle operates in a slow lane configuration with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles present critical challenges: \n1) Adversary 1 positioned on the right side performs a sudden braking maneuver with a delayed reaction time (~2.94s)\n2) Adversary 2 located on the left side executes a more responsive sudden brake (~1.95s reaction time). \nThis scenario is reconstructed from the [vehicle_tracks_007_trajectory_set_36.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_007_trajectory_set_36.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road segment is designated as a special lane type with no temporary traffic control modifications. The traffic density is medium, with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles are present: \n1) Adversary 1 is positioned directly ahead of the ego vehicle (4.98m front gap) and initiates an unsafe left lane change maneuver\n2) Adversary 2 approaches from the right side (3.91m lateral distance) while executing a dangerous right lane change. \n\nThis scenario is reconstructed from the real-world driving dataset [vehicle_tracks_004_trajectory_set_62.json], capturing typical intersection conflict situations.",
    "file_name": "vehicle_tracks_004_trajectory_set_62.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations (marked as special lane type). The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are positioned behind the ego vehicle: \n1) Adversary 1 exhibits sudden braking behavior with a reaction time of 1.29 seconds\n2) Adversary 2 demonstrates aggressive tailgating behavior, maintaining an unsafe following distance of 0.64 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_29.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_29.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with standard traffic rules. The road conditions show no temporary traffic control measures, with the ego vehicle operating in a normal lane type. The traffic density is medium, with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles are present: \n1) A front vehicle positioned 1.5 meters ahead initiates an unsafe left lane change maneuver\n2) A right-side vehicle follows dangerously close at 1.26 meters, exhibiting tailgating behavior. \n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_015_trajectory_set_42.json] dataset.",
    "file_name": "vehicle_tracks_015_trajectory_set_42.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The road segment is marked as a special lane type due to ongoing traffic control measures. The simulation environment features medium traffic density with approximately 20 vehicles. \n\nTwo adversarial vehicles are strategically positioned to create challenging conditions: \n1) Adversary 1 performs a sudden braking maneuver from the left side with a delayed reaction time of 2.17 seconds\n2) Adversary 2 executes an unsafe left lane change at a triggering distance of 3.67 meters from the ego vehicle. \n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_012_trajectory_set_131.json] dataset, capturing authentic intersection dynamics under temporary traffic constraints.",
    "file_name": "vehicle_tracks_012_trajectory_set_131.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road conditions indicate no temporary traffic control measures are in effect, with the ego vehicle occupying a special lane type. The simulation introduces medium traffic density (20 vehicles) with two adversarial vehicles exhibiting hazardous behaviors: \n1) Adversarial Vehicle 1 positioned on the right performs a sudden braking maneuver with a reaction time of 1.81 seconds\n2) Adversarial Vehicle 2 follows dangerously close from behind with only 0.5 meters gap (tailgating behavior). This scenario is reconstructed from real-world driving data [vehicle_tracks_011_trajectory_set_62.json].",
    "file_name": "vehicle_tracks_011_trajectory_set_62.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road segment is designated as a special lane type with no temporary traffic control modifications. The scenario features high traffic density with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles are strategically positioned to create challenging interactions:\n1) Adversary 1 is positioned to the right of the ego vehicle (lateral offset: 1.86m) and initiates an unsafe leftward lane change maneuver\n2) Adversary 2 is positioned ahead of the ego vehicle (longitudinal distance: 2.02m) and performs an unsafe rightward lane change\n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_005_trajectory_set_19.json] dataset.",
    "file_name": "vehicle_tracks_005_trajectory_set_19.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The road conditions indicate no temporary traffic control measures are in effect, with the ego vehicle occupying a special lane type. The traffic density is low, with only 5 vehicles present in the vicinity. Two adversarial vehicles are positioned to the left of the ego vehicle, both exhibiting dangerous tailgating behavior at extremely close distances (0.68m and 0.73m respectively). This scenario is reconstructed from the real-world dataset [vehicle_tracks_001_trajectory_set_73.json], capturing authentic urban intersection dynamics.",
    "file_name": "vehicle_tracks_001_trajectory_set_73.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while approaching a temporarily closed intersection with normal lane markings. The simulation environment features high traffic density (50 vehicles) with two adversarial vehicles exhibiting dangerous behaviors: \n1) Adversary 1 positioned on the right side performs a sudden braking maneuver with a delayed reaction time of 1.87 seconds\n2) Adversary 2 in front maintains dangerously close tailgating distance of 1.19 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_85.json] capturing \"go_straight\" intersection behaviors.",
    "file_name": "vehicle_tracks_012_trajectory_set_85.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle is proceeding straight through the intersection in a slow lane configuration. The scene features high traffic density with approximately 50 vehicles in the vicinity. Two primary adversarial vehicles are positioned behind the ego vehicle with dangerously close following distances: \n- Adversary 1 tailgating at 1.42 meters \n- Adversary 2 aggressively tailgating at just 0.83 meters \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_81.json] representing a \"go_straight\" intersection maneuver under constrained traffic conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_81.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in a slow-speed lane. The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are positioned to the right of the ego vehicle: Vehicle 1 executes an unsafe leftward lane change maneuver with a lateral displacement of 2.21 meters, while Vehicle 2 engages in dangerous tailgating behavior with an unsafe following distance of only 0.81 meters. This scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_010_trajectory_set_76.json] dataset.",
    "file_name": "vehicle_tracks_010_trajectory_set_76.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations in a slow-speed lane. The traffic density is low with only 5 vehicles present. Two adversarial vehicles are positioned to the right of the ego vehicle, both exhibiting unsafe lane-changing behaviors towards the right side. The first adversarial vehicle initiates the maneuver at approximately 4.68 meters ahead, while the second begins closer at 2.32 meters. This scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_007_trajectory_set_129.json] dataset.",
    "file_name": "vehicle_tracks_007_trajectory_set_129.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules. The vehicle operates under special lane conditions without any temporary traffic control modifications. The environment features high traffic density with approximately 50 vehicles present. \n\nTwo adversarial vehicles create challenging conditions: \n1) An aggressive vehicle positioned to the left initiates an unsafe rightward lane change maneuver at a distance of 3.59 meters\n2) A speeding vehicle ahead suddenly accelerates with a speed increase of 11.09 m/s\n\nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_013_trajectory_set_71.json], specifically capturing \"go_straight\" intersection behaviors.",
    "file_name": "vehicle_tracks_013_trajectory_set_71.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles. Two adversarial vehicles create challenging conditions: \n1) Vehicle 1 positioned on the right initiates an unsafe lane change maneuver towards the ego vehicle's lane with a lateral distance of 4.5 meters\n2) Vehicle 2 ahead suddenly accelerates with a significant speed increase of 9.46 m/s. The scenario is reconstructed from real-world dataset [vehicle_tracks_011_trajectory_set_110.json] capturing \"go_straight\" intersection behaviors.",
    "file_name": "vehicle_tracks_011_trajectory_set_110.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle is proceeding straight through the intersection while complying with traffic regulations. The road condition indicates normal lane markings with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles are present: \n1) A leading vehicle (adv1) positioned directly ahead of the ego that will execute a sudden braking maneuver with a delayed reaction time of 2.25 seconds\n2) Another front vehicle (adv2) that will aggressively accelerate with a speed increase of 11.9 m/s\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_015_trajectory_set_99.json] representing a typical urban intersection case.",
    "file_name": "vehicle_tracks_015_trajectory_set_99.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with fast lane regulations. The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles are positioned to the right of the ego vehicle: \n1) An aggressive vehicle executing an unsafe left lane change with 2.43m lateral distance\n2) A sudden-braking vehicle with 1.36s reaction time delay\nThis scenario is reconstructed from real-world driving data [vehicle_tracks_002_trajectory_set_74.json] capturing typical intersection interactions.",
    "file_name": "vehicle_tracks_002_trajectory_set_74.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations. The ego is positioned in the fast lane with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles exhibit hazardous behaviors: \n1) A tailgating vehicle closely following at 1.17 meters rear offset\n2) A right-side vehicle performing sudden braking with 2.37 seconds reaction time. The scenario is reconstructed from real-world driving data [vehicle_tracks_010_trajectory_set_74.json] capturing intersection traversal patterns.",
    "file_name": "vehicle_tracks_010_trajectory_set_74.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road condition features low traffic density (5 vehicles) with normal lane markings. Two adversarial vehicles create challenging conditions: \n1) A rear vehicle exhibiting aggressive speeding behavior with significant velocity increase\n2) A leading vehicle performing sudden braking with delayed reaction time\nThis scenario is reconstructed from the [vehicle_tracks_014_trajectory_set_57.json] dataset, capturing realistic urban intersection dynamics.",
    "file_name": "vehicle_tracks_014_trajectory_set_57.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles present. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned on the left initiates an unsafe right lane change at 3.75m lateral distance\n2) Adversary 2 ahead performs another unsafe right lane change at 3.26m forward distance. \nThe scenario is reconstructed from real-world dataset [vehicle_tracks_007_trajectory_set_98.json] capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_007_trajectory_set_98.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic rules, specifically adhering to a 'special' lane designation without any temporary routing changes. The adversarial conditions simulate high traffic density (50 vehicles) with two notable threat vehicles: \n1) An adversarial vehicle positioned to the left of the ego vehicle executing an unsafe rightward lane change maneuver with 1.34m lateral displacement\n2) A leading adversarial vehicle exhibiting aggressive speeding behavior with an 11.65 m/s velocity increase. This scenario is reconstructed from real-world trajectory data [vehicle_tracks_012_trajectory_set_72.json].",
    "file_name": "vehicle_tracks_012_trajectory_set_72.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory while navigating through a temporarily closed intersection under normal lane conditions. The traffic density is low with only 5 vehicles present. Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversarial Vehicle 1 performs an unsafe right lane change maneuver from the right side of the ego vehicle at a distance of approximately 4.3 meters.\n2) Adversarial Vehicle 2 approaches from the rear with an aggressive speed increase of about 5.16 m/s. This scenario is reconstructed from the real-world dataset [vehicle_tracks_001_trajectory_set_94.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_94.json"
  },
  {
    "original_description": "In this intersection crossing scenario with temporary traffic control measures, the ego vehicle maintains a straight trajectory while adhering to slow lane regulations. The simulation environment features high traffic density (50 vehicles) with two primary adversarial vehicles exhibiting dangerous braking behaviors. Adversarial vehicle 1 is positioned to the right of the ego vehicle with delayed braking response (2.64s reaction time), while adversarial vehicle 2 follows closely behind with more aggressive braking characteristics (1.08s reaction time). This scenario is reconstructed from real-world driving data [vehicle_tracks_014_trajectory_set_133.json] capturing a controlled intersection approach under congested conditions.",
    "file_name": "vehicle_tracks_014_trajectory_set_133.json"
  },
  {
    "original_description": "In this intersection scenario under temporary road closure conditions, the ego vehicle maintains a straight trajectory through the intersection without lane change maneuvers. The road segment is marked as a special lane type due to temporary traffic control measures. The adversarial environment features high traffic density (50 vehicles) with two notable threat vehicles: \n1) A rear-positioned adversarial vehicle exhibiting aggressive speeding behavior (speed increase ~11.8 m/s)\n2) A right-side adversarial vehicle performing sudden braking maneuvers with delayed reaction time (~1.46s). \nThis scenario is reconstructed from the [vehicle_tracks_013_trajectory_set_61.json] dataset in the 'go_straight' collection.",
    "file_name": "vehicle_tracks_013_trajectory_set_61.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules without any temporary lane changes. The vehicle operates in a normal lane type under medium traffic density conditions (approximately 20 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) A rear-positioned vehicle (adv1) that executes sudden braking maneuvers with a reaction time of 1.46 seconds\n2) A right-side vehicle (adv2) that dangerously accelerates with a speed increase of 14.73 m/s\nThis scenario is reconstructed from the real-world dataset [vehicle_tracks_011_trajectory_set_61.json] capturing typical urban intersection interactions.",
    "file_name": "vehicle_tracks_011_trajectory_set_61.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while adhering to slow-lane speed restrictions. The simulation environment features low traffic density with 5 surrounding vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adv1 positioned on the left initiates an unsafe rightward lane change at 3.15m distance \n2) Adv2 also on the left performs a more aggressive rightward lane change at 1.16m proximity. This scenario is reconstructed from real-world driving data [vehicle_tracks_006_trajectory_set_107.json] capturing \"go_straight\" intersection maneuvers.",
    "file_name": "vehicle_tracks_006_trajectory_set_107.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle maintains a straight trajectory while navigating through a temporarily closed intersection under low traffic density conditions (5 vehicles present). The ego vehicle adheres to slow lane regulations during this maneuver. Two adversarial vehicles are positioned directly ahead of the ego vehicle, both exhibiting dangerous tailgating behavior:  \n- Adversary 1 maintains an unsafe following distance of 1.27 meters  \n- Adversary 2 follows even closer at 1.43 meters  \nThis scenario is reconstructed from real-world driving data recorded in dataset [vehicle_tracks_003_trajectory_set_62.json].",
    "file_name": "vehicle_tracks_003_trajectory_set_62.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with traffic regulations. The road environment features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles are strategically positioned to create challenging conditions: \n1) A tailgating vehicle closely following the ego from behind (1.11m gap)\n2) A right-side vehicle executing sudden braking maneuvers with delayed reaction time (2.82s). This scenario is reconstructed from real-world driving data [vehicle_tracks_001_trajectory_set_101.json].",
    "file_name": "vehicle_tracks_001_trajectory_set_101.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with special lane regulations. The traffic density is low with only 5 vehicles present. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 positioned on the left side (1.39m lateral offset) initiates an unsafe left lane change maneuver\n2) Adversary 2 located on the right side (1.59m lateral offset) simultaneously attempts another unsafe left lane change. \nThis scenario is reconstructed from the real-world dataset [vehicle_tracks_004_trajectory_set_67.json] capturing \"go_straight\" intersection behaviors.",
    "file_name": "vehicle_tracks_004_trajectory_set_67.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary road closure regulations (marked as special lane type). The simulation environment features high traffic density with approximately 50 vehicles. Two primary adversarial vehicles are positioned ahead of the ego vehicle: \n1) A lead vehicle executing sudden braking behavior with 1.66s reaction time\n2) Another vehicle performing unsafe right lane change at 4.68m ahead. \nThe scenario is reconstructed from real-world driving data [vehicle_tracks_000_trajectory_set_20.json] capturing typical urban intersection interactions.",
    "file_name": "vehicle_tracks_000_trajectory_set_20.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while strictly adhering to traffic rules with no temporary lane changes permitted. The road condition is characterized by high traffic density (approximately 50 vehicles in the vicinity). Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned at the right-rear performs a sudden braking maneuver with delayed reaction time (2.24s)\n2) Adversary 2 located on the right initiates an unsafe leftward lane change at 3.27m lateral distance. \nThis scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_90.json] capturing typical urban intersection interactions.",
    "file_name": "vehicle_tracks_012_trajectory_set_90.json"
  },
  {
    "original_description": "In this intersection scenario under temporary traffic control, the ego vehicle maintains a straight trajectory while complying with special lane regulations. The simulation environment features medium traffic density with approximately 20 vehicles. Two adversarial vehicles exhibit dangerous behaviors: \n1) A rear-positioned vehicle aggressively accelerates with a speed increase of 6.37 m/s\n2) A right-side vehicle performs sudden braking with an abnormally long reaction time of 2.88 seconds. This scenario is reconstructed from real-world driving data [vehicle_tracks_013_trajectory_set_122.json] capturing a \"go_straight\" intersection maneuver under controlled conditions.",
    "file_name": "vehicle_tracks_013_trajectory_set_122.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory while complying with temporary traffic control measures on a normal lane type. The simulation environment features low traffic density with 5 vehicles present. Two adversarial vehicles are introduced to create challenging conditions: \n1) Adversary 1 positioned on the right side performs a sudden braking maneuver with a reaction time of 1.42 seconds\n2) Adversary 2 located on the left executes an unsafe lane change to the left with a lateral offset of 1.79 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_012_trajectory_set_108.json] capturing typical intersection behaviors.",
    "file_name": "vehicle_tracks_012_trajectory_set_108.json"
  },
  {
    "original_description": "In this intersection crossing scenario under temporary traffic control, the ego vehicle maintains a straight trajectory through the intersection while complying with traffic regulations. The road configuration designates the current lane as a fast lane. The traffic density is low with only 5 vehicles present in the vicinity. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 positioned to the left performs a sudden braking maneuver with a delayed reaction time of 2.61 seconds\n2) Adversary 2 also on the left maintains an unsafe tailgating distance of only 0.74 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_015_trajectory_set_97.json] capturing a typical urban intersection scenario.",
    "file_name": "vehicle_tracks_015_trajectory_set_97.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while complying with standard traffic rules. The road conditions show no temporary traffic control measures, with the ego vehicle operating in a normal lane type. The traffic density is medium (approximately 20 vehicles in the vicinity). \n\nTwo adversarial vehicles are present:\n1. Adversary 1 is positioned to the right of the ego vehicle with a dangerously close following distance of 1.35 meters, exhibiting tailgating behavior.\n2. Adversary 2 approaches from the rear at a distance of 3.16 meters while preparing to execute an unsafe right lane change maneuver.\n\nThis scenario is reconstructed from real-world driving data recorded in the [vehicle_tracks_003_trajectory_set_109.json] dataset.",
    "file_name": "vehicle_tracks_003_trajectory_set_109.json"
  },
  {
    "original_description": "In this intersection crossing scenario, the ego vehicle maintains a straight trajectory through the intersection while adhering to traffic rules. The vehicle operates in the fast lane without any temporary control restrictions. The traffic density is medium with approximately 20 vehicles in the vicinity. Two adversarial vehicles create challenging conditions: \n1) Adversary 1 is positioned to the right of the ego vehicle and exhibits sudden braking behavior with a reaction time of 2.03 seconds\n2) Adversary 2 approaches from the front and initiates an unsafe left lane change at a distance of 2.97 meters. This scenario is reconstructed from real-world driving data [vehicle_tracks_005_trajectory_set_38.json] in the 'go_straight' dataset.",
    "file_name": "vehicle_tracks_005_trajectory_set_38.json"
  }
]