[
  {
    "original_description": "In the intersection scenario, the ego vehicle exhibits a braking maneuver while maintaining a straight trajectory. The road conditions show no temporary changes with special lane markings. The traffic density is low (5 vehicles in the vicinity). Two adversarial vehicles are present: \n1) Vehicle [1] positioned at the rear of the ego vehicle demonstrates aggressive speeding behavior (speed increase: 10.93 m/s)\n2) Vehicle [2] located on the right side engages in dangerous tailgating (following distance: 0.85 m). \nThis scenario is reconstructed from the [HighD] dataset, specifically from the recording segment 'vehicle_tracks_000_trajectory_set_109.json'.",
    "file_name": "vehicle_tracks_000_trajectory_set_109.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle is executing a straight-through maneuver while initiating emergency braking. The road segment is characterized as a slow-speed lane without temporary traffic modifications. The adversarial conditions feature high traffic density (50 vehicles) with two notable threat vehicles: \n1) Adversary [1] positioned laterally to the right of the ego vehicle, exhibiting aggressive speeding behavior with a velocity increase of 10.1 m/s\n2) Adversary [2] following closely behind the ego vehicle, demonstrating delayed reaction (1.44s) followed by sudden braking. This scenario is reconstructed from real-world driving data [vehicle_tracks_000_trajectory_set_115.json] in the brake dataset.",
    "file_name": "vehicle_tracks_000_trajectory_set_115.json"
  },
  {
    "original_description": "In an intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_133.json), the ego vehicle is executing a straight trajectory while performing emergency braking. The scenario occurs on a fast-lane road section without temporary traffic changes. The traffic density is medium with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) Adversary 1 is positioned 0.93 meters to the right of the ego vehicle, exhibiting dangerous tailgating behavior with minimal following distance.\n2) Adversary 2 is located ahead of the ego vehicle and performs sudden braking with a delayed reaction time of 1.49 seconds, creating a potential rear-end collision risk.",
    "file_name": "vehicle_tracks_000_trajectory_set_133.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_134.json), the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road segment is characterized as a fast lane without temporary traffic modifications. The simulation features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 positioned 0.93 meters to the left of the ego vehicle with aggressive following distance\n2) Adversary 2 maintaining an unsafe 0.86-meter gap to the right. This configuration creates a critical situation requiring immediate collision avoidance measures.",
    "file_name": "vehicle_tracks_000_trajectory_set_134.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_147.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures implemented. The traffic density remains low with approximately 5 vehicles in the vicinity. Two adversarial vehicles create hazardous conditions: \n1) Adversary vehicle 1 maintains dangerously close proximity (0.79m) to the ego's left side while tailgating\n2) Adversary vehicle 2 performs an unsafe lane change from the right at 4.74m ahead of the ego vehicle. This scenario captures critical interaction patterns during emergency braking maneuvers in controlled intersection environments.",
    "file_name": "vehicle_tracks_000_trajectory_set_147.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_157.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features a temporary road closure with standard lane markings. The scenario presents high traffic density conditions with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles are positioned to the right of the ego vehicle, both exhibiting sudden braking behaviors with delayed reaction times (1.92s and 2.41s respectively). This creates a critical situation where the ego vehicle must respond to multiple abrupt deceleration events from adjacent vehicles while navigating through congested intersection conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_157.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_23.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures in effect. The simulation presents medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create critical situations: \n1) A front vehicle performing an unsafe left lane change at 1.57m distance \n2) A right-side vehicle exhibiting aggressive speeding behavior with 13.66 m/s speed increase relative to the ego vehicle. This scenario tests emergency response capabilities under combined lateral and longitudinal adversarial conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_23.json"
  },
  {
    "original_description": "In an intersection scenario with high traffic density (approximately 50 vehicles), the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory. The road conditions remain stable with no temporary changes, and the lane type is standard. Two adversarial vehicles are present: \n1) Adversary 1 positioned at the rear with delayed braking response (reaction_time=1.22s)\n2) Adversary 2 located on the left side with more pronounced braking latency (reaction_time=1.93s). \nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset (file: vehicle_tracks_000_trajectory_set_27.json).",
    "file_name": "vehicle_tracks_000_trajectory_set_27.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_28.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures and fast-moving lanes. \n\nThe scenario presents two adversarial conditions: \n1) A vehicle performing an unsafe left lane change from the right side at 3.61m distance\n2) A following vehicle executing sudden braking with 2.75s reaction delay on the right flank. \n\nThe medium traffic density (approximately 20 vehicles) creates a complex dynamic environment where the ego vehicle must respond to both lateral and longitudinal threats simultaneously.",
    "file_name": "vehicle_tracks_000_trajectory_set_28.json"
  },
  {
    "original_description": "In an urban intersection scenario with temporary traffic control measures, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory. The simulation environment replicates high traffic density conditions with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical conflict situations: \n1) Adversary 1 positioned 3.59m ahead of the ego vehicle executes an unsafe left lane change maneuver\n2) Adversary 2 located 1.90m to the left performs a dangerous right lane change. \nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset (file: vehicle_tracks_000_trajectory_set_48.json), featuring special lane markings and controlled intersection conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_48.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_67.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road segment is characterized as a slow-speed lane without temporary traffic modifications. The simulation features medium traffic density with approximately 20 vehicles in the vicinity. Two primary adversarial vehicles are present: \n1) Adversary 1 performs an unsafe right lane change at 2.97m ahead of the ego vehicle\n2) Adversary 2 exhibits speeding behavior with an 11.33 m/s velocity increase in the same direction. This configuration creates a critical testing scenario for emergency response systems in medium-density traffic conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_67.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_71.json), the ego vehicle initiates emergency braking while attempting to proceed straight through a specially designated lane. The situation involves a temporary road closure at the intersection with medium traffic density (~20 vehicles). Two adversarial vehicles create hazardous conditions: \n1) Adversary 1 performs an unsafe left lane change at 4.67m lateral distance from the ego's left side\n2) Adversary 2 executes a dangerous right lane change from 1.35m behind the ego vehicle. This configuration tests the ego vehicle's collision avoidance capabilities during simultaneous lateral and longitudinal threats.",
    "file_name": "vehicle_tracks_000_trajectory_set_71.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_73.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through a temporarily closed intersection with fast-lane characteristics. The high-density traffic environment contains approximately 50 vehicles. Two adversarial vehicles exhibit dangerous lane-change behaviors: \n1) Adversary 1 positioned 2.99m rear-right performs an aggressive right lane change\n2) Adversary 2 located 3.25m right-side executes a sudden left lane intrusion. This configuration creates a critical testing scenario for emergency response systems in congested intersection conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_73.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_80.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features a temporary road closure with special lane markings, creating a high-density traffic condition with approximately 50 vehicles in the vicinity. Two adversarial vehicles exhibit dangerous behaviors: \n1) Adversary 1 performs an unsafe right lane change from the rear position with 4.63m lateral offset \n2) Adversary 2 approaches from the rear at significantly increased speed (+9.49 m/s). This configuration tests the ego vehicle's collision avoidance capabilities under complex intersection dynamics.",
    "file_name": "vehicle_tracks_000_trajectory_set_80.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_91.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary road closure conditions with slow-lane markings. Key adversarial conditions include: \n1) High traffic density (approximately 50 vehicles in the simulation area)\n2) Adversary vehicle 1 positioned directly ahead performing sudden braking with 1.66s reaction delay\n3) Adversary vehicle 2 maintaining dangerous tailgating proximity (1.18m lateral offset) on the left side. This scenario tests emergency response capabilities under combined frontal collision risk and lateral pressure conditions.",
    "file_name": "vehicle_tracks_000_trajectory_set_91.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_92.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with designated slow lanes. The scenario presents medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) A front vehicle (adv1) exhibiting aggressive speeding behavior with a velocity increase of 11.88 m/s relative to the ego vehicle\n2) A left-side vehicle (adv2) performing an unsafe lane change maneuver at a dangerous proximity of 1.88 meters from the ego vehicle's position.",
    "file_name": "vehicle_tracks_000_trajectory_set_92.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_000_trajectory_set_95.json), the ego vehicle executes emergency braking while maintaining a straight trajectory through the intersection. The scenario features high traffic density (approximately 50 vehicles in the simulation area) with two adversarial vehicles exhibiting dangerous behaviors: \n1) Adversary 1 positioned ahead of the ego vehicle demonstrates significant speeding behavior (+12.87 m/s relative speed)\n2) Adversary 2 following the ego vehicle also exhibits aggressive speeding (+11.78 m/s relative speed). \nThe road configuration maintains standard fast-lane characteristics without temporary changes, creating a high-risk braking scenario with multiple speeding threats in both forward and rear positions.",
    "file_name": "vehicle_tracks_000_trajectory_set_95.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_107.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features a temporary road closure with special lane markings, creating a complex driving environment. The traffic density is medium with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) Adversary 1 approaches from the left side with significant speeding behavior (speed increase of 11.61 m/s)\n2) Adversary 2 performs an unsafe left lane change at a dangerously close distance of 2.14 meters ahead of the ego vehicle. This combination of adversarial behaviors during the ego vehicle's emergency braking maneuver creates a high-risk situation requiring immediate collision avoidance.",
    "file_name": "vehicle_tracks_001_trajectory_set_107.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_114.json), the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road segment is characterized as a fast lane with no temporary traffic pattern changes. The simulation features low traffic density with approximately 5 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) A rear-positioned vehicle exhibiting delayed sudden braking behavior (reaction time = 2.03s)\n2) A right-side vehicle performing aggressive speeding (velocity increase = 10.34 m/s)",
    "file_name": "vehicle_tracks_001_trajectory_set_114.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_119.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical situations: \n1) A front vehicle (4.82m ahead) executing an unsafe left lane change maneuver\n2) A right-side vehicle (adjacent lane) performing sudden braking with 1.48s reaction delay. The road configuration maintains standard fast-lane properties without temporary modifications.",
    "file_name": "vehicle_tracks_001_trajectory_set_119.json"
  },
  {
    "original_description": "In an urban intersection scenario, the ego vehicle initiates emergency braking while maintaining a straight trajectory. The simulation environment features temporary traffic control measures with special lane markings. The traffic density is medium, with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) Adversary 1 performs an unsafe left lane change from the right side of the ego vehicle (lateral distance: 2.45m) \n2) Adversary 2 executes another unsafe left lane change from the rear position (longitudinal distance: 2.06m). \n\nThis scenario is reconstructed from real-world driving data [brake] recorded in dataset vehicle_tracks_001_trajectory_set_123.json.",
    "file_name": "vehicle_tracks_001_trajectory_set_123.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_125.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road conditions remain stable with standard lane markings and no temporary modifications. The simulation features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical situations: \n1) Adversary 1 maintains dangerously close proximity (1.17m lateral distance) to the ego's right side while tailgating\n2) Adversary 2 approaches from the rear (1.84m longitudinal distance) while executing an unsafe left lane change maneuver. This configuration presents a complex braking scenario with simultaneous lateral and longitudinal collision risks.",
    "file_name": "vehicle_tracks_001_trajectory_set_125.json"
  },
  {
    "original_description": "In an urban intersection scenario with temporary traffic control measures implemented, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road segment is designated as a slow-speed lane according to traffic regulations. The simulation environment features medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 positioned directly ahead of the ego vehicle (0.98m front offset) exhibits dangerous tailgating behavior\n2) Adversary 2 approaches from the left side (2.85m lateral offset) while executing an unsafe lane change maneuver. This scenario configuration is derived from real-world driving data recorded in the [brake] dataset (recording ID: vehicle_tracks_001_trajectory_set_13.json).",
    "file_name": "vehicle_tracks_001_trajectory_set_13.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_136.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with special lane markings. With low traffic density (approximately 5 vehicles in the vicinity), two adversarial vehicles create critical conditions: \n1) Adversary 1 maintains dangerously close proximity (0.8m lateral offset to the left) exhibiting tailgating behavior\n2) Adversary 2 approaches from the right with significant speed excess (+9.93 m/s relative to ego). This configuration tests emergency response capabilities under asymmetric threat conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_136.json"
  },
  {
    "original_description": "In an urban intersection scenario, the ego vehicle initiates emergency braking while maintaining a straight trajectory. The simulation environment features a temporary road closure with special lane markings, creating atypical traffic conditions. The scenario exhibits medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles present critical challenges: \n1) Adversary 1 performs an unsafe left lane change from the rear position (3.04m offset) \n2) Adversary 2 executes another hazardous left lane change from the adjacent left lane (1.81m lateral offset). \n\nThis scenario is reconstructed from real-world driving data [brake] recording vehicle_tracks_001_trajectory_set_144.json, capturing complex interaction patterns during intersection navigation under abnormal road conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_144.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_145.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical situations: \n1) Adversary 1 performs an unsafe right lane change at 3.9 meters lateral distance\n2) Adversary 2 tailgates the ego vehicle at dangerously close proximity (0.67 meters). The road configuration involves special lane markings requiring heightened attention during braking maneuvers.",
    "file_name": "vehicle_tracks_001_trajectory_set_145.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_147.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features medium traffic density with approximately 20 vehicles in the simulation area. Two adversarial vehicles create critical situations: \n1) Adversary 1 performs an unsafe left lane change from the right side with 2.42m lateral distance\n2) Adversary 2 tailgates dangerously close (0.94m following distance) from the left side. The ego vehicle's braking maneuver occurs in a fast-lane context without temporary road modifications.",
    "file_name": "vehicle_tracks_001_trajectory_set_147.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_150.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road conditions remain stable with no temporary changes, featuring standard lane markings. The simulation presents a low traffic density environment with approximately 5 vehicles. \n\nTwo adversarial vehicles create critical situations: \n1) A tailgating vehicle positioned 1.25m behind the ego vehicle, maintaining dangerously close proximity\n2) A front vehicle performing an unsafe right lane change at 2.25m ahead, exhibiting aggressive maneuvering behavior. This configuration tests the ego vehicle's emergency response capabilities in constrained spatial conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_150.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_151.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road conditions remain stable with no temporary changes, featuring standard lane markings. The high traffic density environment (approximately 50 vehicles) presents two critical adversarial conditions: \n1) A front vehicle (Adversary 1) exhibiting aggressive speeding behavior with a 9.25 m/s speed increase\n2) Another front vehicle (Adversary 2) performing an unsafe right lane change at a dangerous proximity of 2.88m. This scenario tests the ego vehicle's collision avoidance capabilities during sudden deceleration while surrounded by high-risk traffic maneuvers.",
    "file_name": "vehicle_tracks_001_trajectory_set_151.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_157.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road conditions remain stable with no temporary changes, featuring standard lane markings. The simulation environment contains medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) A front vehicle exhibiting aggressive speeding behavior with a 12.77 m/s velocity increase\n2) A right-side vehicle demonstrating even more extreme speeding at 14.49 m/s above the ego's initial speed. This configuration presents a complex braking scenario where the ego vehicle must respond to both frontal and lateral speed differentials while executing its emergency maneuver.",
    "file_name": "vehicle_tracks_001_trajectory_set_157.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_158.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road configuration remains stable with no temporary changes, featuring special lane markings. The simulation presents low traffic density with approximately 5 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) A left-side vehicle performing sudden braking with 1.85s reaction delay\n2) A rear vehicle exhibiting aggressive speeding behavior with 14.46 m/s speed increase relative to the ego vehicle. This scenario effectively tests emergency response systems in sparse traffic conditions with asymmetric threats.",
    "file_name": "vehicle_tracks_001_trajectory_set_158.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_162.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with designated slow lanes. The scenario presents challenging adversarial conditions including high traffic density (approximately 50 vehicles in the vicinity). \n\nTwo adversarial vehicles create critical situations: \n1) A front vehicle (adv1) exhibits dangerous tailgating behavior with only 1.19m following distance\n2) A right-side vehicle (adv2) performs sudden braking with delayed reaction time of 1.97 seconds. This configuration tests the ego vehicle's emergency response capabilities in congested intersection conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_162.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_165.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with special lane markings. The traffic density is low with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) A rear vehicle significantly exceeding speed limits (+14.36 m/s relative to ego)\n2) A leading vehicle executing an unsafe left lane change at 4.4m ahead of the ego vehicle. This scenario tests the ego vehicle's emergency response capabilities in constrained traffic conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_165.json"
  },
  {
    "original_description": "In an urban intersection scenario, the ego vehicle initiates emergency braking while maintaining a straight trajectory. The simulation environment replicates temporary road closure conditions with special lane markings, creating a complex traffic situation. The scenario features high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) A lead vehicle (Adversary 1) positioned directly ahead performs sudden braking with a delayed reaction time of 1.43 seconds\n2) A left-side vehicle (Adversary 2) exhibits dangerous tailgating behavior with an unsafe following distance of 0.54 meters. This scenario is reconstructed from real-world driving data [brake] recording vehicle_tracks_001_trajectory_set_166.json.",
    "file_name": "vehicle_tracks_001_trajectory_set_166.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_182.json), the ego vehicle initiates emergency braking while attempting to proceed straight through a specially-marked intersection with temporary road closure conditions. The simulation environment features low traffic density (approximately 5 vehicles in the vicinity). Two adversarial vehicles create hazardous conditions: \n1) Adversary 1 performs an unsafe leftward lane change at 4.68m lateral distance \n2) Adversary 2 executes a dangerous rightward lane change maneuver at 1.82m proximity. Both adversarial vehicles exhibit aggressive lane-changing behaviors that challenge the ego vehicle's emergency braking maneuver in this constrained intersection environment.",
    "file_name": "vehicle_tracks_001_trajectory_set_182.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_186.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures and fast-moving lanes. The scenario presents high traffic density with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) Adversary 1 positioned on the left side performs sudden braking with a delayed reaction time of 2.30 seconds\n2) Adversary 2 on the right side exhibits similar sudden braking behavior with a slightly faster reaction time of 2.10 seconds. This configuration tests the ego vehicle's collision avoidance capabilities in dense traffic with simultaneous bilateral threats.",
    "file_name": "vehicle_tracks_001_trajectory_set_186.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The simulation environment features a temporarily closed intersection with fast-moving lanes. The scenario includes medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) A rear vehicle performing sudden braking with delayed reaction time (1.30s) \n2) A left-side vehicle executing an unsafe right lane change at 2.09m lateral distance. \n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from the trajectory file 'vehicle_tracks_001_trajectory_set_34.json'.",
    "file_name": "vehicle_tracks_001_trajectory_set_34.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_37.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features temporary traffic control measures with designated slow lanes. The simulation involves medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles exhibit dangerous tailgating behaviors: \n1) Adversary 1 maintains an unsafe following distance of 1.20 meters on the right side\n2) Adversary 2 demonstrates more aggressive tailgating with only 0.72 meters clearance on the left side. This configuration creates a high-risk sandwich scenario where the ego vehicle must handle simultaneous lateral pressure while executing emergency braking.",
    "file_name": "vehicle_tracks_001_trajectory_set_37.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_52.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features a temporary road closure with standard lane markings. The traffic density remains low with approximately 5 vehicles in the vicinity. Two adversarial vehicles create challenging conditions: \n1) Vehicle [1] positioned on the right side exhibits aggressive speeding behavior with a 14.24 m/s speed increase\n2) Vehicle [2] on the left demonstrates dangerous tailgating behavior with an unsafe following distance of only 0.56m. This configuration tests the ego vehicle's collision avoidance capabilities in constrained spatial conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_52.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_54.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulated environment features a temporarily closed intersection with fast-lane conditions and medium traffic density (approximately 20 vehicles). Two adversarial vehicles create critical situations: \n1) Adversary 1 follows dangerously close behind the ego vehicle (1.30m rear offset) exhibiting tailgating behavior\n2) Adversary 2 approaches aggressively from the front (1.19m forward offset) while maintaining unsafe proximity. This configuration tests the ego vehicle's collision avoidance capabilities during sudden deceleration in constrained traffic conditions.",
    "file_name": "vehicle_tracks_001_trajectory_set_54.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_57.json), the ego vehicle initiates emergency braking while attempting to proceed straight through a specially-marked lane under temporary road closure conditions. The simulation environment features low traffic density with approximately 5 vehicles present. Two adversarial vehicles create hazardous conditions: \n1) Left-side vehicle executing sudden braking with 2.75s reaction delay\n2) Left-side tailgating vehicle maintaining dangerously close proximity (0.81m following distance)",
    "file_name": "vehicle_tracks_001_trajectory_set_57.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_60.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures in effect. The simulation involves medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create hazardous conditions: \n1) A front vehicle tailgating at an unsafe distance of 1.42 meters \n2) A right-side vehicle maintaining dangerously close proximity of 1.29 meters. Both adversarial vehicles exhibit aggressive following behaviors that challenge the ego vehicle's emergency braking maneuver.",
    "file_name": "vehicle_tracks_001_trajectory_set_60.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_71.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road configuration remains stable with no temporary changes, featuring special lane markings. The simulation presents a low traffic density environment with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles are positioned behind the ego vehicle with distinct hazardous behaviors: \n1) Adversary 1 demonstrates aggressive speeding behavior with a velocity increase of 9.02 m/s\n2) Adversary 2 exhibits dangerous sudden braking characteristics with an abnormally long reaction time of 1.42 seconds",
    "file_name": "vehicle_tracks_001_trajectory_set_71.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle is executing an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road environment features temporary closure conditions with standard lane markings. Traffic density remains low with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles are present in front of the ego vehicle: \n1) Adversary 1 demonstrates aggressive speeding behavior with a 9.89 m/s speed increase\n2) Adversary 2 performs sudden braking with a delayed reaction time of 2.12 seconds\n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from recording segment vehicle_tracks_001_trajectory_set_89.json.",
    "file_name": "vehicle_tracks_001_trajectory_set_89.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_9.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with standard lane configurations. The scenario presents challenging adversarial conditions including high traffic density (approximately 50 vehicles in the vicinity). \n\nTwo adversarial vehicles create critical situations: \n1) A rear vehicle significantly exceeding speed limits (7.65 m/s speed differential)\n2) A left-side vehicle maintaining dangerously close following distance (1.04m gap) with tailgating behavior. The combination of high-density traffic and aggressive adversarial behaviors creates a complex braking scenario requiring immediate collision avoidance.",
    "file_name": "vehicle_tracks_001_trajectory_set_9.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_001_trajectory_set_93.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures in effect. The simulation presents medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) A rear vehicle executing sudden braking with significantly delayed reaction time (2.56s) \n2) A left-side vehicle aggressively speeding with a 12.15 m/s velocity increase. This scenario effectively captures complex interaction dynamics during emergency maneuvers in controlled intersection environments.",
    "file_name": "vehicle_tracks_001_trajectory_set_93.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_100.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features temporary road closure conditions with fast-lane characteristics. The environment presents medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles are positioned on the left side of the ego vehicle, both exhibiting sudden braking behaviors with distinct reaction delays (1.66s and 2.17s respectively), creating a critical longitudinal collision risk scenario.",
    "file_name": "vehicle_tracks_002_trajectory_set_100.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_101.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road conditions show no temporary changes with normal lane markings. The simulation features low traffic density (approximately 5 vehicles in the vicinity). Two adversarial vehicles create hazardous conditions: \n1) Adversary 1 performs an unsafe right lane change at 4.77m right offset from the ego vehicle\n2) Adversary 2 executes another dangerous right lane change from 2.31m rear position. Both adversarial maneuvers occur during the ego vehicle's emergency braking phase, creating a complex multi-threat collision avoidance scenario.",
    "file_name": "vehicle_tracks_002_trajectory_set_101.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_102.json), the ego vehicle performs emergency braking while maintaining a straight trajectory through the intersection. The scenario occurs under temporary traffic control conditions with fast-moving lanes. The environment features medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles exhibit dangerous tailgating behavior from the left side of the ego vehicle: \n- Adversary 1 maintains an unsafe following distance of 0.52 meters\n- Adversary 2 follows at 0.86 meters, both violating safe following distances for the current speed and road conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_102.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_103.json), the ego vehicle initiates emergency braking while attempting to proceed straight through the intersection. The simulation environment features a temporary road closure with slow-lane traffic conditions. The scenario presents medium traffic density (approximately 20 vehicles) with two key adversarial interactions: \n1) An aggressive vehicle performing an unsafe right lane change from the left side (lateral offset: 1.15m)\n2) A speeding vehicle approaching from the rear with significant velocity differential (+13.53 m/s)",
    "file_name": "vehicle_tracks_002_trajectory_set_103.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_108.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures in effect. The simulation presents low traffic density conditions with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Vehicle [1] positioned on the right-side performs an unsafe left lane change at a dangerous proximity of 1.88 meters\n2) Vehicle [2] approaches from the front with significant speeding behavior, exceeding the ego's speed by 5.44 m/s (19.6 km/h)",
    "file_name": "vehicle_tracks_002_trajectory_set_108.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_113.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features a temporary road closure with slow-lane conditions and medium traffic density (approximately 20 vehicles in the vicinity). \n\nTwo adversarial vehicles create complex interactions:\n1) Adversary 1 performs an unsafe left lane change from the rear position (4.92m behind ego)\n2) Adversary 2 executes an unsafe right lane change from the front position (4.39m ahead of ego)\n\nThis configuration presents a challenging situation where the ego vehicle must handle simultaneous lateral threats from both directions while decelerating in constrained road conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_113.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road conditions remain stable with no temporary changes, and the lane type is classified as a slow-speed lane. The simulation environment features high traffic density with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 positions itself on the left side of the ego vehicle with a dangerous tailgating behavior (maintaining only 1.37m following distance)\n2) Adversary 2 approaches from the right side with delayed reaction time (1.59s) before executing a sudden braking maneuver. \n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from recording segment vehicle_tracks_002_trajectory_set_114.json.",
    "file_name": "vehicle_tracks_002_trajectory_set_114.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_116.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features temporary traffic control measures with designated slow lanes. The simulation presents a low traffic density condition with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 follows dangerously close behind the ego vehicle with a rear gap of only 0.57 meters, exhibiting aggressive tailgating behavior\n2) Adversary 2 approaches from the left side at significantly increased speed (10.33 m/s faster than ego), creating a speeding hazard during the ego vehicle's braking maneuver.",
    "file_name": "vehicle_tracks_002_trajectory_set_116.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_117.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features temporary closure conditions with standard lane markings. The simulation presents low traffic density (approximately 5 vehicles in the vicinity). Two adversarial vehicles create critical situations: \n1) Adversary 1 performs an unsafe right lane change from the left-side position (2.34m lateral offset) \n2) Adversary 2 executes sudden braking from the left with a delayed reaction time of 2.84 seconds. This scenario tests the ego vehicle's collision avoidance capabilities during complex multi-threat interactions.",
    "file_name": "vehicle_tracks_002_trajectory_set_117.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road conditions indicate temporary traffic control measures are active, with the lane designated as a slow-moving zone. The simulation environment features low traffic density with approximately 5 vehicles present. \n\nTwo adversarial vehicles are positioned behind the ego vehicle: \n1) Adversary Vehicle 1 exhibits aggressive speeding behavior with a velocity increase of 6.2 m/s\n2) Adversary Vehicle 2 demonstrates delayed braking response with a reaction time of 1.57 seconds\n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from the trajectory file 'vehicle_tracks_002_trajectory_set_129.json'.",
    "file_name": "vehicle_tracks_002_trajectory_set_129.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_13.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures in effect. Traffic density remains low with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) Adversary 1 positioned 0.59m to the right of the ego vehicle exhibits aggressive tailgating behavior with dangerously short following distance\n2) Adversary 2 also on the right side demonstrates speeding behavior with a velocity increase of 7.88 m/s relative to the ego vehicle. This configuration presents a complex braking scenario where the ego vehicle must respond to both lateral proximity threats and differential speed conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_13.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_15.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features a temporary road closure with special lane markings, creating atypical traffic conditions. The environment exhibits high traffic density with approximately 50 vehicles in the vicinity. Two adversarial vehicles present critical challenges: \n1) Adversary 1 positioned on the left side demonstrates aggressive speeding behavior with a velocity increase of 10.7 m/s relative to the ego vehicle\n2) Adversary 2, also on the left side, performs an unsafe rightward lane change maneuver at a dangerous proximity of 3.28 meters from the ego vehicle. This configuration creates a complex multi-threat situation requiring immediate collision avoidance.",
    "file_name": "vehicle_tracks_002_trajectory_set_15.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_18.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features high traffic density with approximately 50 vehicles in the simulation area. Two adversarial vehicles create critical situations: \n1) A right-side vehicle performing sudden braking with 2.98s reaction delay\n2) A front vehicle executing an unsafe left lane change at 4.72m distance. The road configuration maintains standard slow-lane characteristics without temporary modifications.",
    "file_name": "vehicle_tracks_002_trajectory_set_18.json"
  },
  {
    "original_description": "In an urban intersection scenario with temporary traffic control measures implemented, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road segment is classified as a fast lane with medium traffic density (approximately 20 vehicles in the vicinity). Two adversarial vehicles create hazardous conditions: \n1) Adversary 1 follows dangerously close behind the ego vehicle with a tailgating distance of 1.26 meters\n2) Adversary 2 approaches from the rear while executing an unsafe right lane change at a distance of 2.28 meters. This scenario is reconstructed from real-world driving data recorded in the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_2.json).",
    "file_name": "vehicle_tracks_002_trajectory_set_2.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_24.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features temporary traffic control measures with designated slow lanes. The environment presents medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create critical situations: \n1) A front vehicle (4.25m ahead) executing an unsafe right lane change maneuver\n2) A left-side vehicle (immediate proximity) performing sudden braking with 1.12s reaction delay. This configuration tests the ego vehicle's collision avoidance capabilities under combined lateral and longitudinal threats.",
    "file_name": "vehicle_tracks_002_trajectory_set_24.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_26.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with special lane markings. The scenario presents medium traffic density with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical conditions: \n1) Adversary 1 approaches from the left side with significant speed increase (+7.98 m/s)\n2) Adversary 2 positioned ahead executes sudden braking with delayed reaction time (2.10s). This configuration tests the ego vehicle's collision avoidance capabilities under combined lateral and longitudinal threats.",
    "file_name": "vehicle_tracks_002_trajectory_set_26.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The simulation environment features standard lane markings and temporary traffic control measures. The traffic density is set to medium level with approximately 20 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 follows dangerously close behind the ego vehicle with a rear gap of only 0.91 meters, exhibiting clear tailgating behavior. \n2) Adversary 2 performs an unsafe lane change from the left side with an insufficient lateral distance of 2.54 meters during the maneuver. \n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from the trajectory file 'vehicle_tracks_002_trajectory_set_30.json'.",
    "file_name": "vehicle_tracks_002_trajectory_set_30.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_49.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulated environment features a temporarily closed intersection with fast-lane characteristics. The traffic density remains low with approximately 5 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) Vehicle [1] positioned on the right-side performs sudden braking with a reaction delay of 1.30 seconds\n2) Vehicle [2] approaching from the rear executes sudden braking with a faster reaction time of 1.06 seconds. This configuration tests the ego vehicle's collision avoidance capabilities under asymmetric braking conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_49.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_57.json), the ego vehicle initiates emergency braking while attempting to proceed straight through the intersection. The scenario features temporary road closure conditions with special lane markings. The simulation environment contains medium traffic density with approximately 20 vehicles. \n\nTwo adversarial vehicles create critical situations: \n1) A left-side vehicle performing sudden braking with 2.48s reaction delay\n2) A rear vehicle executing unsafe right lane change at 2.34m following distance. This configuration tests the ego vehicle's collision avoidance capabilities under combined lateral and longitudinal threats.",
    "file_name": "vehicle_tracks_002_trajectory_set_57.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_69.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The scenario features low traffic density with approximately 5 vehicles in the vicinity. Two adversarial vehicles create critical conditions: \n1) Adversary 1 positioned on the right side exhibits aggressive speeding behavior with a velocity increase of 14.48 m/s relative to the ego vehicle.\n2) Adversary 2 performs an unsafe left lane change at a dangerous proximity of 1.46 meters from the ego vehicle. The road configuration maintains standard fast-lane characteristics without temporary modifications.",
    "file_name": "vehicle_tracks_002_trajectory_set_69.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_71.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulated environment features a temporary road closure with fast-lane characteristics. The scenario presents high traffic density conditions with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 positioned 1.32m to the right exhibits aggressive speeding behavior with a velocity increase of 6.28 m/s\n2) Adversary 2 maintains dangerously close following distance (1.32m) from the right side while matching the ego's speed, demonstrating classic tailgating behavior.",
    "file_name": "vehicle_tracks_002_trajectory_set_71.json"
  },
  {
    "original_description": "In this intersection scenario from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_76.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with special lane markings. The scenario presents medium traffic density with approximately 20 vehicles in the vicinity. Two adversarial vehicles create critical situations: 1) A left-side vehicle performing an unsafe right lane change at 1.33m lateral distance, and 2) A front vehicle exhibiting dangerous tailgating behavior with only 1.05m following distance. This configuration tests the ego vehicle's collision avoidance capabilities under complex urban driving conditions.",
    "file_name": "vehicle_tracks_002_trajectory_set_76.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_83.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures and fast-moving lanes. The scenario presents challenging adversarial conditions with high traffic density (approximately 50 vehicles in the vicinity). \n\nTwo primary adversarial vehicles are positioned relative to the ego: \n1) A front vehicle exhibiting dangerous tailgating behavior with only 1.05 meters following distance\n2) A right-side vehicle performing sudden braking with a delayed reaction time of 1.22 seconds. This configuration creates a critical situation testing the ego vehicle's collision avoidance capabilities under combined lateral and longitudinal pressure.",
    "file_name": "vehicle_tracks_002_trajectory_set_83.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The simulation environment features temporary traffic control measures with designated slow lanes. The scenario presents high traffic density conditions with approximately 50 vehicles in the vicinity. \n\nTwo adversarial vehicles create critical situations: \n1) Adversary 1 positioned on the left side of the ego vehicle executes a sudden braking maneuver with a delayed reaction time of 2.32 seconds\n2) Adversary 2 approaches from the front at a distance of 2.24 meters while performing an unsafe right lane change. \n\nThis scenario is reconstructed from real-world driving data recorded in the [brake] dataset, specifically from recording segment vehicle_tracks_002_trajectory_set_91.json.",
    "file_name": "vehicle_tracks_002_trajectory_set_91.json"
  },
  {
    "original_description": "In this intersection scenario captured from the [brake] dataset (recording: vehicle_tracks_002_trajectory_set_92.json), the ego vehicle initiates emergency braking while maintaining a straight trajectory through the intersection. The simulation environment features a temporary road closure with standard lane markings. The scenario presents high traffic density conditions with approximately 50 vehicles in the vicinity. Two adversarial vehicles create critical situations: 1) Vehicle [1] performs an unsafe right lane change from the left side with 3.51m lateral distance, and 2) Vehicle [2] exhibits tailgating behavior with dangerously close following distance of 1.46m from the rear.",
    "file_name": "vehicle_tracks_002_trajectory_set_92.json"
  },
  {
    "original_description": "In this intersection scenario, the ego vehicle initiates an emergency braking maneuver while maintaining a straight trajectory through the intersection. The road environment features standard lane markings with temporary traffic control measures implemented. Traffic density remains low with approximately 5 vehicles in the vicinity. \n\nTwo adversarial vehicles create challenging conditions: \n1) Adversary 1 positions itself on the right side of the ego vehicle while exhibiting aggressive speeding behavior (velocity increase of 10.93 m/s)\n2) Adversary 2 approaches from the left side with significant speed elevation (8.27 m/s increase). \n\nThis scenario configuration is derived from real-world driving data recorded in the [brake] dataset (recording ID: vehicle_tracks_002_trajectory_set_99.json).",
    "file_name": "vehicle_tracks_002_trajectory_set_99.json"
  }
]